{"podcast_details": {"podcast_title": "Fearless Presentations", "episode_title": "How to Make Boring Speeches More Interesting and Exciting", "episode_image": "https://storage.buzzsprout.com/variants/r9pp3hdqr90ymb1ahu8lwxhpog7c/f6fd9b4ca4e468e7e11c8350463c894b252ee834d352e0a8d889b97ac83aedef.jpg", "episode_transcript": " This is episode number 267 of the Fearless Presentations podcast, the fastest, easiest way to eliminate public speaking fear. Want to absolutely eliminate public speaking fear? This podcast is the answer. Here's the guy who literally wrote the book on Fearless Presentations, Doug Stannert. Hey, welcome to Fearless Presentations. I'm Doug Stannert, CEO of the Leaders Institute. And my goal is to help you become a fearless and confident speaker and presenter. This week, I'm going to give you my secret to delivering boring presentations. In fact, this secret is absolutely the most important thing that you have to know in order to get every single audience that ever hears you speak to fall in love with you as a speaker. Actually, I'll give you a little hint right now. There is actually no such thing as a boring speech or a boring topic. There are only boring speakers, but you don't have to be one of them. By the way, the episode is sponsored by fearless presentations dot com. So if you're looking for a faster way to reduce public speaking fear or become a more persuasive speaker, we've got two day public speaking classes coming up in cities like Philadelphia, Dallas, Baltimore, Atlanta, Los Angeles, Detroit, Washington, D.C., Boston, Milwaukee, Minneapolis, Orlando, Miami, and Houston. For details about these or any of our other classes, just go to fearlesspresentations.com. All right. So let's get on with today's topic. The secret of great presentations. By the way, if you take only one piece of advice from this entire recording, make sure that it's the pearl of wisdom in this section. I mean, basically, if you focus on this one simple thing, the number of times that you say, oh, won't matter. If you focus on this one simple thing, your gestures and not knowing what to do with your hands won't matter. If you focus on this one simple thing, the occasional loss of train of thought is not going to matter either. In fact, if you focus on this one simple thing, you can pretty much break every single rule that that public speakers are supposed to abide by. And you're still going to win over your audience. This one simple rule, by the way, has transformed countless mediocre speakers into good speakers and scores of good speakers into great speakers and numerous great speakers into world class speakers. And basically, the simple rule that you that can really make or break a speaker is enthusiasm. That's right. If you have a little excitement in your talk and a spring in your step, then people will pay attention to you. Your audience will have just about as much excitement about the talk or the presentation that you're delivering as what you do. And really, they're not going to have any more energy than that. So if you want to win over your audience, you add a sparkle of enthusiasm to your delivery and and it'll excel your presentation in ways that you can't even imagine. One of my mentors, by the way, gave me two rules to live by in the world of professional speaking. She basically said rule number one is to never, ever, ever speak on a topic that you yourself are not enthusiastic about. And then she said rule number two is that if you ever violate rule number one, fake it till you make it right. By the way, years ago, I read a book by Frank Bencher called How I raised myself from failure to success in selling. Fantastic book. If you have not read it, if you're an entrepreneur, if you're in sales, this is a goldmine of really good content. But basically in that book and in the very first chapter, basically, Frank described what my mentor told me in a little bit different way. Basically, what he said was, if you act enthusiastic, you'll be successful. If you act enthusiastic, you'll be enthusiastic. And sometimes people will hear me say that and they'll kind of respond, wait, wait, wait a minute. Are you telling us that we should be inauthentic? Right. And no, I mean, that's not at all what we're saying. In fact, enthusiasm, it's not a feeling, it's a habit that we develop. It's kind of like if you're a runner or a jogger, you know, runners will a lot of times people who run a lot will say crazy things like, I just feel much better after a long run. I mean, I'm not sure what kind of running that they do, but I never feel better after a long run. I feel tired. Right. And if it's a really long run, I feel like I'm going to throw up. But people who have created the habit of running or jogging, they don't feel this way at all. In fact, the only difference between the two of us, the folks who are really, really good at running and me, is the habits that we've developed. So basically, if you kind of take Frank Becher's words and kind of replace them with running, it'll sound like if you act like a runner, you will be a runner. Right. And sure, it's not going to happen right away. But if you develop the habits that great runners develop over time, you're going to be a great runner. It's the habits that we develop that determine who we are and what attitude that we show to the world. So the other thing that you want to keep in mind about energy and enthusiasm is that enthusiasm is contagious. So in addition, when you show enthusiasm and energy to your audience, then they're going to give energy and enthusiasm back to you. So when you act enthusiastic, like Becher says, your audience will actually pick up on that energy. As you look out over your crowd, you're going to see smiles and positive head nods. And you'll see that, especially when you say something that the people in the audience agree with. Now, these positive cues will actually help you continue to show additional enthusiasm as well. So the opposite is true. If you bring negative energy into your speeches, then your audience will actually feed off your negative energy. And they'll give you back that negative energy. But if you give off energy, especially really positive energy, your audience will actually give you energy. So the choice is yours. I give you an example. Years ago, I was co-teaching a class with another speaker. And at the time, I had a very severe cold. But the client that booked me for this meeting booked me well in advance, months before I was actually going to speak. And I didn't want to cancel on them, even though I was feeling horribly. So I basically just went into the speech, went into the presentation. I just used my normal high energy cadence, even though it was exhausted most of the time. And the returning energy from the audience actually helped me feel better about the presentation as well. It helped me feel better physically from the energy that they were giving off to me. As the last class member left the room that afternoon, I basically had my energy had just gone at that point. I just collapsed in one of the chairs. And the co-instructor, the guy who was teaching the class with me, he was a little startled when I did that. And he said, are you OK? Because I probably looked horrible at that point. And that's when I told him for the first time that I wasn't feeling well. And he responded with, man, you could have fooled me. What? Wait. In fact, I guess you did fool me because I had no idea. So I basically had the choice to be the low energy sick Doug or the high energy professional Doug. And I chose the latter. And the audience received a much better presentation as a result. By the way, for those of us who get nervous in front of a group, it's actually even easier to show enthusiasm. If you remember back in the previous episode, I pointed out that 90% of our nervousness doesn't show. Well, let's look at the 10% that remains. The 10%, those things that actually do show when we're nervous, like for instance, we'll tend to kind of cut out preambles and get right to our point. Our rate of speech will sometimes typically increase. We'll start talking faster. We tend to move around a lot more because those nervous ticks, we tend to move our hands around more than normal. And by the way, when we're excited about something, we do those exact same things. Now, years ago, when I was a sales manager, I was often amazed at the number of times that a brand new salesperson without a whole lot of product knowledge and absolutely no experience could close sale after sale after sale, while some of my more seasoned salespeople were kind of struggling. And after going on many sales calls with these new salespeople, I started to kind of notice a pattern. The new salesperson is often pretty nervous. So when they walk into an office on a sales call, they tend to cut right to the chase. They also generally talk faster because they're afraid they're going to forget something. They have a tough time sitting still because of the nervous energy. And so they kind of move around a lot. I notice that these symptoms of nervousness, they sometimes actually work to the advantage of the new salesperson. I'll give you an example. On one of these appointments, I was shadowing one of my new salespeople. In fact, by the way, I was a brand new sales manager. This was the first guy that I had ever trained. And it was the first time that I had ever actually gone on a sales call shadowing somebody else as the boss. So the poor guy, he'd been working for the company for less than a week. And not only did he have to remember all of the training that we'd given him, but also he had the added pressure of having his boss, me, watching him. So basically the week before this appointment, I'd given him a three ring binder. It was what we called a pitch book that had details about the product that we were selling. And then he and I practiced repeatedly over and over and over again in my office. First, I would go through the book with him, and then he would do the same for me. And he had the presentation down pretty well. His pitch, his presentation lasted about 10 minutes or so every time that he gave it to me. So when he started the presentation with his first sales prospect, though, with me in the room and his nervousness was really high, in fact, the nervousness just kind of shot through the roof. He only, he spent only a few seconds on each one of the pages of the book. So he would read what was on the page and he would flip to the next one, read what was on the next page and flip it to the next one, that kind of thing. And he went through the pitch so fast that I began to think, just kind of as a joke in my head, I'm thinking, maybe his car's being towed or something, because he was zooming through the presentation really, really quickly. Well, when he finished, he just kind of sat there staring at the poor woman who he was presenting to. And I was embarrassed for him. I mean, I was a little concerned for myself as well. That was my first time as a manager. And right off the bat, I had failed miserably when I was training this poor guy. And then the woman that he was presenting to, she finally broke that awkward silence by saying, huh, you know what, that sounds pretty good. And the new sales guy pulled out a contract, he closed the deal. Well, that whole chain of events just confused the heck out of me. I'd never seen anything like this. In fact, that was a little kind of shell shock when we left her office, because I was kind of asking myself, what the heck just happened, right? Well, it turns out that this woman saw this guy's nervousness as something totally different. She saw excitement and passion about what he was selling. She didn't want to miss the boat, so she jumped on board. So we can actually use this same thing to our advantage as speakers as well. When we turn that pent up nervousness into energy and we turn it into enthusiasm, then our audience can't help but be energized as well. So the next time that you're asked to speak to a group, instead of focusing on the nervousness, focus on your energy. If you have to fake it at first, don't worry, because the energy that you give off to your audience will be returned to you when the audience begins to have fun and you're gonna have some fun too. So just like what Frank Betcher said, if you act enthusiastic, you're gonna be enthusiastic. So here are a few action items that I would suggest to help really apply this skill in your next presentation. So before you actually get up to speak, list three things that you can do during your next presentations to help you look and act more enthusiastic. What are some of those things? For instance, you might say, you know what? I think I'm going to not focus on talking more slowly. I think I'm gonna talk kind of quickly. I'm gonna try to actually talk faster and see if that works. You'd be surprised if you don't. You'd be surprised just by doing something a little like that, you can increase your energy exponentially. Focus on your gestures, using your gestures more often or moving around the room a little bit more. So list the things that you think are gonna help you be more enthusiastic. So by the way, in the masterclass guide that I provided for you at fearlesspresentations.com slash audio dash guide, I've given you a few application points, action items that you can do to increase your energy and enthusiasm and a few links to additional articles and videos that you can use to help you really increase your enthusiasm and energy the next time you give a presentation. So make sure and check out the guide. And we'll see you next week on the Fearless Presentations Podcast. And we'll see you next week on the Fearless Presentations Podcast."}, "podcast_summary": "In this episode of the Fearless Presentations podcast, the host discusses the secret to delivering engaging presentations. He emphasizes that enthusiasm is the most important factor in captivating an audience and advises against speaking on a topic one is not enthusiastic about. The host shares personal anecdotes and examples to illustrate how enthusiasm can transform an average speaker into a great one. He also explains how enthusiasm is contagious and can energize the audience. The host concludes by offering action items to help speakers appear more enthusiastic during their presentations.", "podcast_guest": "Doug Stannert", "podcast_highlights": "Here are some key points from the podcast:\n\n- The secret to delivering boring presentations is enthusiasm.\n- Enthusiasm is the most important thing to get every audience to fall in love with you as a speaker.\n- Enthusiasm is not a feeling, but a habit that can be developed.\n- Enthusiasm is contagious, and when you show enthusiasm, your audience will give you energy back.\n- Even if you're nervous, showing enthusiasm can work to your advantage as a speaker.\n- Act enthusiastic, and you will become enthusiastic.\n- List three things you can do during your presentations to appear more enthusiastic.\n- The podcast also provides additional resources and action items to increase your energy and enthusiasm.\n\nYou can get more details and access the full audio guide at fearlesspresentations.com/audio-guide."}