{"podcast_details": {"podcast_title": "Hey Riddle Riddle", "episode_title": "Patreon Preview #232: KMC Cinema", "episode_image": "https://www.omnycontent.com/d/playlist/77bedd50-a734-42aa-9c08-ad86013ca0f9/3c014aab-9177-41d0-9705-ad8d012bc513/7cd8dba9-548c-479e-9bbe-ad8d012bc52f/image.jpg?t=1629742289&size=Large", "episode_transcript": " Excuse me. Excuse me. I'm sorry. I don't mean to bother you or to interrupt. Yeah, how can I help you? I just saw you waiting up here at the front of the movie theater. Okay. You look like you're waiting for someone. You look a little nervous. Am I reading the situation wrong at all? That I'm waiting for someone and nervous? You're waiting for a date, aren't you? I mean, if I'm being honest, it looks like you're waiting for a date to come in. A little date at the movie theater? That's what it looks like. Well, you're not wrong, old friend. Sorry, old man. We don't know each other really. I met someone on Hinge. You wouldn't know what that is. You probably are thinking of doors. What's a dating app? Well, kind of. But she said she'd be here. It's two after, and I fear that... My favorite part of the movie is the trailers. I let her know that, so I hope she's okay, but also at the same time... You look like you're what, 19, 20 years old? 19 and a half, yeah. Young, but still an adult. Okay. Where's this going? You look nervous. I'm an old man. I've been on many first dates at the movie theater. Okay. Congratulations. Can I give you a little advice, friend? From an old man to a young man experiencing the very beginning of his dating journey, from a fella who's admittedly at the end of his dating journey. Can I ask a question first? How did those dates go? Did you end up with any of those dates? My man, I fucked on every first date I ever went on my entire life. Okay. I always close. I always close. Okay. Like, Glen Gary, Glen Ross, or so my dad says. I'm good, man. You can move along. More like Glen Harry, Glen Balls, if you know what I'm saying, my man. What? Glen Harry, Glen Balls? Do you think you're gonna smash tonight? Honestly, that's not even where my head's at. Then your head's in the wrong place, because the answer to that question, young man, should always be yes. You should always be, you should be, be an honest with yourself. That's what you want to do. That's what you're gonna do. Okay. You gotta believe it. You gotta believe it to manifest it, to make it happen. People don't say smash anymore. That's kind of gauche and gross. What's your fuck style? We say hulk. We say are you gonna hulk out? What's your fuck style? I'm actually a, I'm a Madonna, as us kids say today. A Madonna? Yeah. Like a virgin? You mean, you're like a virgin? Yeah. But virgin is a gauche word, it's kind of gone out of style, so we say Madonna. Even if you've never fucked, you should know what your fuck style is. How do you practice? How many hours do you practice? Don't make me say masturbation. I think that you can... No, no. That's not practice. You're working backwards if you're masturbating. Help. Help. I will. I'm trying. You're around. Hey, kid. I'm trying to help you. Hey. Hey, kid. Yes, yes, yeah? Do you know who you're talking to right now? No. That's the ghost of Gregory Peck. Lucky you. What? Yeah. From To Kill a Mockingbird. Lucky you. But I thought, when I watched, when my dad plays his movies, he's always like, Scout, Jim, her, let's go to the courthouse. That's, to me, that's Gregory Peck. No, that's Jimmy Stewart. Oh. I thought Jimmy Stewart was like, he's a pookah. Hey, come on, Mr. Washington, we're going to the Senate. Can I be honest? You don't want to be doing Gregory Peck or Jimmy Stewart impressions if you're trying to smash. It worked for the Pecker Man back in the day. Hey, lady. Hey, lady. Hey, lady. Yeah? I think this is the ghost of Gregory Pecker. Either way, you're the luckiest kid alive. Take all his advice. Look, I don't want to take up too much of your time. You're at the movie theater. You're obviously excited about your first date. You obviously don't want my advice, even though it's very good advice and I always fuck on the first date and there's never a second date. But that's fine. That's fine. You know, enjoy the rest of your night. I'll just be, I'll just go back over to my corner and wait for the next young man who might want to listen to my advice. Mr. Peck, I release you. Mr. Peck, I release you. Mr. Peck, I release you. I heard this. I heard this. Only one way to, there's only one way to release me if you know what I'm saying. Oh, come on, man. Come on. Let's all go to the lobby. Two tickets to the Guardians of the Galaxy, please. Okay. Which, we do have, we have what we call our triple feature where we're playing all three. Which Guardians of the Galaxy did you want to see? Um, the best one. Okay, that would be oddly number two. Okay, let's put that in there. My son loves these films and I'm trying to get him to talk to me about anything. So I thought I would do something he likes so we can connect. Oh, perfect. I do have to ask, it's just in the computer system here. Are you going to talk to him after the movie? Because we don't allow talking in the theaters. Yeah, after the movie. Not call him and leave him voicemails the whole time about my thoughts. Perfect. I do have to enter Sly Grin into the system here just because that's what you gave. So I'm going to put you, let's see, I'm going to put you in row K. That is right at the... K? Correct. K. Okay, and we do have a KMC offer today only where we can have sort of boosters on your seat so you're sitting a little bit higher. Sure, I can bring my Tupperware filled with tuna salad in, right? Yes, this is Tuna Tuesdays. I also have a bottle of red wine with me to make the occasion. Well, wine Wednesdays are tomorrow so if you could leave the wine outside or at least on our system not drinking. I'll leave it outside. Perfect. Not put it in my coat. Absolutely. Okay. And we do have a special deal where for $2 extra you can give the opening speech along with Nicole Kidman about movies. Better not. Are you sure? Yeah. Better not. Okay. All right. Okay. And we do have... Wait, let's see. You come to this place for magic. Dazzling images. I'm gonna have to charge you $2 if you keep going. If you go past, because here they are, I have to charge you $2. Heartbreak feels good in a place like this. I'll give you my money. You deserve it. All right. Just a few more offers here. We do have a special popcorn bucket to celebrate the new Guardians of the Galaxy, but yours too. No. No. I have to do the full picture or I'll get fired, ma'am. Fine. It is called Groot Suit Riot. It's a giant Groot in a zoot suit. He has an old style sort of cherry popping down his zoot suit. He does say Groot Suit Riot. I don't know who that man is because I haven't seen the films yet. Oh, well, we'll keep you at $2. I think $2 is the best introduction. A few more offers here. Are you a legacy member? Were your parents... Did your parents ever see a movie? Well, one of my parents died here. Does that come from anything? Let me check with my manager. Hey, Frank? Mm-hmm. Yeah. This lady's... One of this lady's parents died in a KMC. Is that... Mother or father. Is that like a free popcorn upgrade? Mother or father? Unless you had... Mother. Mother? Oh, yes. It's like being Jewish. If it came from the mother, then it does count officially. So yes, free popcorn. It would be a free popcorn. So we can give you a free popcorn. And go ahead and upgrade it to the zoot Groot Riot. We'll give you the... Oh, it's zoot... I was saying Groot Suit... Oh, okay. To the zoot Groot Riot. Let me see. I don't like popcorn. Can I have something else, please? Ma'am, it's an eight foot tall tree filled with popcorn. It's got to turn heads. I don't like popcorn. Okay, one more upgrade offer. We do have Guardians of the Galaxy 2 available in 5DX. Now that's like 40X, but there is some sort of anal stimulation. Yes. Casey's typing. Oh no, with her son. We know we're not alone with how we feel about the way people talk about women's sports. We want to be part of the solution. Having been there many times before ourselves, Tobin and I are going to bring to you what it's like to play in a World Cup, what's really happening behind the scenes, all the good juicy bits. The recap show will bring you gal culture at its finest. We all know what bro culture is, but what is gal culture? We're here to define it. We have incredible guests joining us. You're going to get the strongest perspective, the strongest minds the game has to offer. This is our narrative, our culture, and we get to tell it our way. Nobody can speak about the World Cup better than us. You'll hear it all on the recap show. Premiering July 20th, you're going to find the recap show everywhere. YouTube, TikTok, Twitter, Instagram, threads, and wherever you get your podcasts. Welcome to the recap. Welcome to the show. I love Jay."}, "podcast_summary": "The podcast script is a conversation between two individuals, one older and one younger, at a movie theater. The older person offers advice on dating and sex, while also mentioning famous actors such as Gregory Peck and Jimmy Stewart. The younger person is waiting for a date and expresses nervousness. The script includes humor and references to popular culture.", "podcast_guest": "Gregory Peck", "podcast_highlights": "Here are some key points and highlights from the podcast excerpt:\n\n- The conversation begins with a young man waiting nervously for a date at a movie theater.\n- An old man approaches him and offers dating advice, claiming to always have success on first dates.\n- The old man asks about the young man's \"fuck style\" and advises him to be confident and honest in his intentions.\n- A comedic exchange follows, with the old man impersonating the ghost of Gregory Peck and discussing movie preferences.\n- The young man eventually goes to purchase tickets and is offered various upgrades and promotions by the theater employee.\n- The conversation ends with the young man deciding against the upgrades and requesting a different snack than popcorn.\n\nNote: This text has been edited for clarity and brevity."}